tutorials/multiphase/driftFluxFoam/ras/tank3D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (sludge water);

sludge
{
    transportModel  BinghamPlastic;

    "(plastic|BinghamPlastic)Coeffs"
    {
        coeff       0.00023143;
        exponent    0.17926;

        BinghamCoeff    5.5469e-07;
        BinghamExponent 95.25;
        BinghamOffset   0;

        muMax       10;
    }

    rho         1042;
}

water
{
    transportModel  Newtonian;

    nu              1.78e-06;
    rho             1000;
}

relativeVelocityModel simple;

"(simple|general)Coeffs"
{
    V0              (0 -0.002198 0);
    a               8.84;
    a1              0.1;
    residualAlpha   0;
}

// ************************************************************************* //
